<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<title>Skeneriai - skeneriai | Skeneriai</title>
<meta name="keywords" content="Skeneriai - skeneriai" />
<meta name="description" content="Skeneriai - skeneriai" />
<link href="style.css" rel="stylesheet" type="text/css" media="screen" />


</head>
<body id="Cbr2SQuc1">
<div id="header">
	<div id="menu">
		<ul>
			<li class="current_page_item"><a href="index.html">Homepage</a></li>
			<li id="2Uwt6TvmcnRixye"><a href="privacy-policy.html">Privacy policy</a></li>
			<li id="tTabxXbmp2eU6L"><a href="terms.html">Terms and Conditions</a></li>
			<li id="peFdeGdjoy2b"><a href="photo.html">Photo gallery</a></li>
			<li id="ZJM3uzwQ5Jg1Re3"><a href="contact.html">Contacts</a></li>
		</ul>
	</div>
	<!-- end #menu -->
	<div id="logo">
		<h1>Skeneriai</h1>
	</div>
	<hr />
</div>
<!-- end #header -->
<!-- end #header-wrapper -->
<!-- end #logo -->
<div id="page">
	<div id="page-bgtop">
		<div id="page-bgbtm">
			<div id="content">
				<div class="post"  id="AuRdebM">
					<p class="meta"  id="P3GfcCbhDkI1on"><span class="date">2020.10.29 08:42</span> Posted by <a href="#">Someone</a></p>
					<h2 class="title"><a href="#">Skeneriai - skeneriai</a></h2>
					<div class="entry" id="J6mTOfwUOcnOrVA">
					<hr><br><br>
			<iframe width="560" height="315" src="https://www.youtube.com/embed/lcvSjGeDCLg" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
						<span> <span> Skeneriai</span> </span> Blogas Apie Kontaktai <h2> Skeneriai </h2> <p> <span> 12/4/2013 </span> </p> <p> 0 Comments </p> <strong> Skeneriai</strong> <br/> <br/> Skai&#269;iavime, atvaizdo skaitytuvas da&#382;nai, sutrumpintas &#303; tik, yra skaitytuvas prietaisas, kuris opti&scaron;kai per&#382;i&#363;ri atvaizdus, i&scaron;spausdint&#261; tekst&#261;, ra&scaron;ysen&#261;, ar objekt&#261;, ir paver&#269;ia tai &#303; skaitmenin&#303; atvaizd&#261;. Bendri pavyzd&#382;iai, surasti &#303;staigose, yra darbalaukio pakitimai (ar plan&scaron;et&#279;) skaitytuvas, kur dokumentas yra pad&#279;tas ant stiklinio lango tam, kad per&#382;i&#363;r&#279;t&#371;. Portatyviniai skeneriai, kur prietaisas yra perkeltas rankomis, pl&#279;tojo nuo teksto per&#382;i&#363;r&#279;jimo "burt&#371; lazdeles" &#303; 3-uosius skaitytuvus, panaudotus pramoniniam dizainui, apgr&#261;&#382;os in&#382;inerijai, testui ir matavimui, orthotics, &#382;aisdami ir kitoms parai&scaron;koms. Mechani&scaron;kai vairuoti skeneriai, kurie perkelia dokument&#261; yra tipi&scaron;kai naudojami didelio formato dokumentams, kur plan&scaron;et&#279;s projektas b&#363;t&#371; neprakti&scaron;kas. &Scaron;iuolaikiniai skeneriai tipi&scaron;kai naudoja kaltinimu sujungt&#261; prietais&#261; (CCD) ar Kontakto Atvaizdo Davikl&#303; (NVS) kaip atvaizdo daviklis, tuo tarpu vyresni b&#363;gno skeneriai naudoja fotodaugiklio vamzd&#303; kaip atvaizdo davikl&#303;. Rotacinis skaitytuvas, panaudotas didelio grei&#269;io dokumento per&#382;i&#363;r&#279;jimui, yra kitas b&#363;gno skaitytuvo tipas, naudodamas CCD rinkin&#303; vietoj fotodaugiklio. Kiti skaitytuv&#371; tipai yra planetiniai skeneriai, kurie ima fotografijas knyg&#371; ir dokument&#371;, ir 3-&#371;j&#371; skaitytuv&#371;, tam, kad pagamint&#371; trima&#269;ius objekt&#371; modelius. Kita skaitytuvo kategorija yra skaitmeniniai telekameros skeneriai, kurie yra pagr&#303;sti reprographic telekamer&#371; s&#261;voka. D&#279;l did&#279;jan&#269;io sprendimo ir nauj&#371; ypatybi&#371; toki&#371; kaip antipakratymas, skaitmenin&#279;s telekameros tapo patrauklia alternatyva reguliariems skaitytuvams. Vis dar tur&#279;damas nenaud&#261; palyginti su tradiciniais skeneriais (tokiais kaip i&scaron;kraipymas, atspind&#382;iai, &scaron;e&scaron;&#279;liai, &#382;emai skiriasi), skaitmeniniai telekamer&#371; pasi&#363;lymo prana&scaron;umai tokie kaip greitis, mobilumas ir &scaron;velnus stor&#371; dokument&#371; pervedimas &#303; skaitmenin&#281; form&#261;, nepakenkdamas knygos stuburui. Naujos per&#382;i&#363;r&#279;jimo technologijos kombinuoja 3-uosius skaitytuvus su skaitmenin&#279;mis telekameromis, kad sukurt&#371; piln&#261; spalv&#261;, fotorealistinius 3-uosius objekt&#371; modelius. [citavimui reik&#279;jo] biomedicininiame tyrin&#279;jimo rajone, susekimo prietaisus DNR mikrorinkiniams pavadina skeneriais be to. &Scaron;itie skeneriai yra su didele skiriam&#261;ja geba sistemos (iki 1 &micro;m/vaizdo elemento), pana&scaron;us &#303; mikroskopus. Susekimas yra padarytas per CCD ar fotodaugiklio vamzd&#303; (PMT).<br/> <br/> <strong> Istorija</strong> <br/> <br/> &Scaron;iuolaikinius skaitytuvus laiko ankstyvo telephotography ir fakso &#303;vesties prietais&#371; per&#279;m&#279;jais. Pantelegraph (ital&#371; kalba: pantelegrafo; pranc&#363;z&#371; kalba: pant&eacute;l&eacute;graphe), buvo ankstyva forma fakso perdavimo per normalias telegrafo linijas, i&scaron;vystytas Giovanni Caselli, panaudoto komerci&scaron;kai 1860-aisiais, kuris buvo pirmas toks prietaisas, kad &#303;eit&#371; &#303; praktin&#281; paslaug&#261;. Tai panaudojo elektromagnetus, kad vairuot&#371; ir sinchronizuot&#371; jud&#279;jim&#261; &scaron;vytuokli&#371; &scaron;altinyje ir nutolusioje vietoje, per&#382;i&#363;r&#279;ti ir atkurti atvaizdus. Tai gal&#279;jo perduoti ra&scaron;ysen&#261;, para&scaron;us, ar pie&scaron;im&#261; iki 150 x 100 mm rajono viduje. &Eacute;douard Belin Belinograph 1913, per&#382;i&#363;r&#279;tas naudojimas fotoelemento ir perduotas per &#303;prastas telefono linijas, suformavo pagrind&#261; AT&amp;T Wirephoto paslauga. Europoje, paslaugas, pana&scaron;ias &#303; wirephoto, pavadino Belino. Tai buvo panaudota naujien&#371; agent&#363;r&#371; nuo 1920-&#371;j&#371; iki 1990-&#371;j&#371; vidurio, ir susid&#279;jo i&scaron; rotuojan&#269;io b&#363;gno su vienu fotodetektoriumi standartiniu 60 ar 120 rpm grei&#269;iu (v&#279;lesni modeliai iki 240 rpm). Jie siun&#269;ia linijin&#303; pana&scaron;&#371; AM signal&#261; per standartines telefonines balso linijas &#303; receptorius, kurie sinchroni&scaron;kai spausdina proporcing&#261; intensyvum&#261; ypatingame popieriuje. Spalvotas nuotraukas nusiunt&#279;, kadangi trys atsiskyr&#279;, RGB filtravo atvaizdus nuosekliai, bet tiktai ypatingiems &#303;vykiams d&#279;l perdavimo kain&#371;.<br/> <br/> <br/> <strong> Tipai</strong> <br/> <br/> <br/> <strong> B&#363;gninis</strong> <br/> Pirmas atvaizdo skaitytuvas, i&scaron;vystytas naudojimui su kompiuteriu, buvo b&#363;gno skaitytuvas. Tai buvo pastatyta 1957 USNational Biure Standart&#371; komandos vadovaujant Russell A. Kirsch. Pirmas atvaizdas, kada nors per&#382;i&#363;r&#279;tas ant &scaron;ios ma&scaron;inos, buvo 5 cm kvadratin&#279; fotografija Vy&scaron;nios s&#363;naus "tada trys m&#279;nuo", Walden. Theblack ir baltas atvaizdas tur&#279;jo sprendim&#261; 176 vaizdo element&#371; ant pus&#279;s. <br/> <span> </span> <br/> <span> </span> <strong> B&#363;gniniai skaneriai </strong> grobimo atvaizdo informacija su fotodaugiklio vamzd&#382;iais (PMT), o ne kaltinimu sujungtu prietaisu (CCD) rinkiniai, surasti plan&scaron;et&#279;s skaitytuvuose ir nebrangiuose filmo skaitytuvuose. Atspindintys ir transmissive originalai yra pasodinti ant akrilinio cilindro, skaitytuvo b&#363;gno, kuris rotuoja dideliu grei&#269;iu tuo metu, kai tai perduoda objekt&#261;, per&#382;i&#363;r&#279;t&#261; prie&scaron; tikslumo optik&#261;, kurie tiekia atvaizdo informacij&#261; PMTs. Labiausiai &scaron;iuolaikiniai spalvoti b&#363;gno skeneriai naudoja trys, atitiko PMTs, kurie perskaito raudon&#261;, m&#279;lyn&#261;, ir &#382;ali&#261; &scaron;vies&#261;, atitinkamai. &Scaron;viesa nuo originali&#371; meno k&#363;rini&#371; yra perskelta &#303; atskirus raudonus, m&#279;lynus, ir &#382;alius spindulius optiniame skaitytuvo suole. B&#363;gno skaitytuvas gauna savo vard&#261; nuo ai&scaron;kaus akrilinio cilindro, b&#363;gno, ant kurio original&#363;s meno k&#363;riniai yra pasodinti tam, kad per&#382;i&#363;r&#279;t&#371;. Priklausomai nuo dyd&#382;io, galima pasodinti originalus iki 20 "x28", bet maksimalus dydis kei&#269;iasi gamintojo. Viena i&scaron; unikali&#371; b&#363;gno skaitytuv&#371; ypatybi&#371; yra geb&#279;jimas kontroliuoti tipin&#303; rajon&#261; ir skyl&#279;s dyd&#303; nepriklausomai. Tipinis dydis yra rajonas, kur&#303; skaitytuvas encoder skaito, kad sukurt&#371; atskir&#261; vaizdo element&#261;. Skyl&#279; yra tikras atidarymas, kuris leid&#382;ia &scaron;vies&#261; &#303; optin&#303; skaitytuvo suol&#261;. Geb&#279;jimas kontroliuoti skyl&#281; ir tipin&#303; dyd&#303; atskirai yra ypa&#269; naudingas lyginimo filmo gr&#363;dui, per&#382;i&#363;r&#279;damas nespalvot&#261; ir spalvoto negatyvo originalai. Tuo metu, kai b&#363;gno skeneriai yra gebantys per&#382;i&#363;r&#279;jim&#261; ir atspindintys, ir transmissive meno k&#363;riniai, geros kokyb&#279;s plan&scaron;et&#279;s skaitytuvas gali pagaminti geras per&#382;i&#363;ras i&scaron; atspindin&#269;i&#371; meno k&#363;rini&#371;. Tod&#279;l, b&#363;gno skeneriai yra retai naudojami, kad per&#382;i&#363;r&#279;t&#371; atspaudus dabar, kai auk&scaron;tos kokyb&#279;s, nebrang&#363;s plan&scaron;et&#279;s skeneriai yra noriai pasiekiami. Filmas, ta&#269;iau, yra, kur b&#363;gno skeneriai t&#281;sia b&#363;ti &#303;rankiu pasirinkimo auk&scaron;to galo parai&scaron;koms. Kadangi filmas gali b&#363;ti &scaron;lapias pasodintas &#303; skaitytuvo b&#363;gn&#261; ir d&#279;l i&scaron;skirtinio PMTs jautrumo, b&#363;gno skeneriai yra gebantys gauti labai subtilias detales filmo originaluose. Tiktai kelios kompanijos t&#281;sia gaminti b&#363;gno skaitytuvus. Tuo metu, kai kainos ir nauj&#371;, ir panaudot&#371; vienet&#371; nusileido per pra&#279;jus&#303; de&scaron;imtmet&#303;, jie vis dar reikalingas didel&#279;s pinigin&#279;s investicijos kai palyginti su CCD plan&scaron;ete ir filmo skeneriais. Ta&#269;iau, b&#363;gno skeneriai lieka pageidaujami d&#279;l j&#371; geb&#279;jimo pagaminti per&#382;i&#363;ras, kurios yra geresn&#279;s sprendime, da&#382;o gradacij&#261;, ir vertina strukt&#363;r&#261;. Taip pat, tod&#279;l, kad b&#363;gno skeneriai yra gebantys sprendimus iki 24 000 PPI, j&#371; naudojimas yra apskritai rekomenduojamas, kai per&#382;i&#363;r&#279;tas atvaizdas ketina b&#363;ti padidintas. Daugumos grafini&#371; men&#371; operacij&#371;, labai auk&scaron;tos kokyb&#279;s plan&scaron;et&#279;s skeneriai pakeit&#279; b&#363;gno skaitytuvus, b&#363;dami ir ma&#382;iau brang&#363;s ir greitesni. Ta&#269;iau, b&#363;gno skeneriai t&#281;sia b&#363;ti panaudoti auk&scaron;to galo parai&scaron;kose, tokiose kaip muziejaus kokyb&#279;s archyvavimas fotografij&#371; ir auk&scaron;tos kokyb&#279;s knyg&#371; ir &#382;urnalo reklamini&#371; skelbim&#371; atspaudo gamyba. Be to, d&#279;l didesnio ikipriklausan&#269;i&#371; vienet&#371; tinkamumo, daug puiki&#371; menini&#371; fotograf&#371; &#303;sigyja b&#363;gno skaitytuvus, kuris suk&#363;r&#279; nauj&#261; ni&scaron;os rink&#261; ma&scaron;inos<br/> <span> </span> <br/> <span> </span> .<br/> <span> </span> <br/> <span> </span> <strong> Plan&scaron;etin&#279;</strong> <br/> <span> </span> <br/> <span> </span> <strong> CCD skaitytuvas</strong> <br/> Plan&scaron;et&#279;s skaitytuvas yra paprastai sudaromas i&scaron; stiklinio stiklo (ar velen&#279;lis), po kuriuo yra ry&scaron;ki &scaron;viesa (da&#382;nai xenon, VESTAS ar &scaron;altas fluorescencinis katodas), kuris &scaron;vie&#269;ia stikl&#261;, ir judant&#303; optin&#303; rinkin&#303; CCD per&#382;i&#363;r&#279;jime. CCD-surinkite skaitytuvus, tipi&scaron;kai turi savyje tris eiles (rinkiniai) davikli&#371; su raudonais, &#382;aliais, ir m&#279;lynais filtrais.<br/> <span> </span> <br/> <span> </span> <br/> <span> </span> <br/> <span> </span> <strong> NVS skaitytuvas</strong> <br/> NVS per&#382;i&#363;r&#279;jimas susideda i&scaron; jud&#279;jimo komplekto raudono, &#382;alio ir m&#279;lyno LEDs strobed ap&scaron;vietimui ir susijusiam monospalvotam fotodiodo rinkiniui po ryk&scaron;t&#279;s l&#281;&scaron;io rinkiniu lengvai kolekcijai. Atvaizdai, kurie b&#363;t&#371; per&#382;i&#363;r&#279;ti, yra pad&#279;ti, duoda atkirt&#303; ant stiklin&#279;s, matin&#279; danga yra nuleista per j&#261;, kad pa&scaron;alint&#371; supan&#269;i&#261; &scaron;vies&#261;, ir daviklio rinkinys ir &scaron;viesos &scaron;altinis &#303;veikia stikl&#261;, skaitydami vis&#261; rajon&#261;. Atvaizdas yra tod&#279;l matomas &#303; detektori&#371; tik d&#279;l &scaron;viesos, kuri&#261; tai atspindi. Vaisk&#363;s atvaizdai nedirba tokiu b&#363;du, ir reikalingas ypating&#371; reikmen&#371;, kurios &scaron;vie&#269;ia juos nuo vir&scaron;utin&#279;s pus&#279;s. Daug skaitytuv&#371; si&#363;lo tam kaip pasirinkimas.<br/> <span> </span> <br/> <span> </span> <strong> Juostinis</strong> <br/> <span> DSLR telekamera ir skaidr&#279;s skaitytuvas</span> <br/> <span> </span> <br/> <span> </span> "Slysite" (teigiamas) ar neigiamas filmas gali b&#363;ti per&#382;i&#363;r&#279;tas &#303;rangoje, specialiai gamintoje &scaron;iuo tikslu. Paprastai, nesuma&#382;inti diafilmai iki &scaron;e&scaron;i&#371; r&#279;m&#371;, ar keturi&#371; pasodint&#371; skaidri&#371;, yra &#303;d&#279;ti &#303; ve&#382;&#279;j&#261;, kuris yra perkeltas stepper variklio per l&#281;&scaron;&#303; ir CCD daviklio skaitytuve. Kai kurie modeliai yra daugiausia panaudoti to-paties-dyd&#382;io per&#382;i&#363;roms. Filmo skeneriai kei&#269;iasi daug kaina ir kokybe. Vartotojo skeneriai yra palyginti nebrang&#363;s tuo metu, kai brangiausias profesinis CCD bazavosi, filmo per&#382;i&#363;r&#279;jimo sistema buvo apytiksliai 120 000 JAV doleri&#371;. Pasakoma, kad brangesni sprendimai duoda geresni&#371; rezultat&#371;.<br/> <span> </span> <br/> <span> </span> <strong> </strong> <br/> <span> </span> <br/> <span> </span> <strong> Rankinis</strong> <br/> GeniScan GS4500 Paduoda Skaitytuv&#261;<br/> <span> </span> <br/> <span> </span> Rank&#371; skeneriai atvyksta &#303; dvi formas: dokumentas ir 3-ieji skeneriai. Ranka laik&#279;si, dokumento skeneriai yra rankiniai prietaisai, kuriuos tempia per atvaizdo pavir&scaron;i&#371;, kuris bus per&#382;i&#363;r&#279;tas. Dokument&#371; &scaron;iame b&#363;de per&#382;i&#363;r&#279;jimas reikalingas pastovios rankos, kadangi nelygi per&#382;i&#363;r&#279;jimo norma pagamint&#371; i&scaron;kraipytus atvaizdus - ma&#382;a &scaron;viesa ant skaitytuvo parodys, jei jud&#279;jimas buvo per greitas. Jie tipi&scaron;kai turi "prad&#382;ios" mygtuk&#261;, kuris yra laikytas vartotojo per&#382;i&#363;ros trukmei; kai kurie jungikliai, kad nustatyt&#371; optin&#303; sprendim&#261;; ir volas, kuris kuria laikrod&#382;io puls&#261; sinchronizacijai su kompiuteriu. Dauguma rank&#371; skaitytuv&#371; buvo vienspalviai, ir pagamino &scaron;vies&#261; i&scaron; &#382;alio LEDs rinkinio, kad ap&scaron;viest&#371; atvaizd&#261;. Tipi&scaron;kas rank&#371; skaitytuvas taip pat tur&#279;jo ma&#382;&#261; lang&#261;, per kur&#303; dokumentas, per&#382;i&#363;r&#279;tas, gal&#279;jo b&#363;ti ap&#382;i&#363;r&#279;tas. Jie buvo populiar&#363;s per prad&#382;i&#261; 1990-&#371;j&#371; ir paprastai tur&#279;davo priklausant&#303; interfeiso modul&#303;, specifin&#303; tam tikram tipui kompiuterio, paprastai Atari &Scaron;V. ar Laivyno karininkas Amiga. Tuo metu, kai populiarumas dokumento per&#382;i&#363;r&#279;jimui nyko, rankos naudojimas laik&#279;si, 3-ieji skeneriai lieka populiarus daugeliui parai&scaron;k&#371;, apimdamas pramonin&#303; dizain&#261;, apgr&#261;&#382;os in&#382;inerij&#261;, ap&#382;i&#363;r&#261; &amp; analiz&#281;, skaitmenin&#281; gamyb&#261; ir medicinos parai&scaron;kas. Kad i&scaron;mok&#279;t&#371; kompensacij&#261; u&#382; nelyg&#371; &#382;mogaus rankos jud&#279;jim&#261;, dauguma 3-&#371;j&#371; per&#382;i&#363;r&#279;jimo sistem&#371; pasitiki sud&#279;liojimu u&#382;uominos &#382;ymekli&#371; &ndash; tipi&scaron;kai lipnios atspindin&#269;ios etiket&#279;s kad skaitytuvo naudojimas, kad i&scaron;sirikiuot&#371; &#303; eil&#281; elementus ir &#382;ym&#279;s pad&#279;tis erdv&#279;je.<br/> <span> </span> <br/> <span> </span> <strong> I&scaron;maniojo telefono skeneris</strong> <br/> <span> </span> <br/> <span> </span> Telekameros smartphones pasiek&#279; sprendim&#261; ir kokyb&#281;, kuri&#261; protingos kokybi&scaron;kos per&#382;i&#363;ros gali b&#363;ti pasiektos, imdamos fotografij&#261; su telefonu ir naudodamos per&#382;i&#363;r&#279;jim&#261; app tam, kad poapdirbt&#371; (tokie kaip balinimas fono puslapio, perspektyvinio i&scaron;kraipymo pataisymas, kad dokumentas b&#363;t&#371; i&scaron;vestas kaip teisingas sta&#269;iakampis, pakeitimas &#303; nespalvot&#261;, ir taip toliau), Dauguma smartphone platform&#371; dabar turi diapazon&#261; skaitytuvo apps pasiekiamas. &Scaron;itie apps gali tipi&scaron;kai per&#382;i&#363;r&#279;ti daugialypius puslapio dokumentus vartojant daugialyp&#303; telekameros neapsaugojim&#261;, ir i&scaron;vesti juos &#303; PDF dokument&#261; ar kaip atskiri JPEG atvaizdai. Ka&#382;koks smartphone, per&#382;i&#363;rintis apps, gali taip pat sutaupyti dokumentus tiesiogiai d&#279;l internetini&#371; laikymo viet&#371;, toki&#371; kaip Dropbox andEvernote, si&#371;sti per elektronin&#303; pa&scaron;t&#261; ar fakso dokumentai per elektroninio pa&scaron;to iki fakso vartus. [citavimas, b&#363;tinas] Smartphone skaitytuvas apps, gali b&#363;ti pla&#269;iai padalytas &#303; tris kategorijas: 1) Dokumentas per&#382;i&#363;r&#279;damas apps (Jie yra pirmiausiai suprojektuoti, kad pasielgt&#371; su dokumentais ir i&scaron;vest&#371; PDF rinkmenas - nors keli gali taip pat i&scaron;vesti JPEG), 2) Fotografija, per&#382;i&#363;r&#279;damas apps (Jie i&scaron;veda JPEG rinkmenas, ir turi redagavimo funkcijas, naudingas fotografijai, o ne dokumento redagavimui.) 3) QR, per&#382;i&#363;rintys apps (Jie gali panaudoti per&#382;i&#363;r&#279;tus QR atvaizdus automatically, ie&scaron;ko interneto d&#279;l susijusios informacijos.)<br/> <span> </span> <br/> <span> </span> <strong> Kokyb&#279;</strong> <br/> <span> </span> <br/> Plan&scaron;et&#279;s skaitytuvas. Dokumentai ar atvaizdai yra pad&#279;ti veidas &#382;emyn po danga (parodytas u&#382;daryt&#261; &#269;ia).<br/> <span> </span> <br/> skeneriai tipi&scaron;kai perskaito raudon&#261; &#382;ali&#261; m&#279;lyn&#261; spalv&#261; (RGB) duomenys nuo rinkinio. &Scaron;ie duomenys yra tada apdirbti su ka&#382;kokiu priklausan&#269;iu algoritmu, kad pataisyt&#371; skirtingoms neapsaugojimo s&#261;lygoms, ir nusi&#371;sti &#303; kompiuter&#303; per prietaiso &#303;vesties/produkcijos interfeis&#261; (paprastai USB, anks&#269;iau kuris wasSCSI ar dvikryptis lygiagretus uostas vyresniuose vienetuose). Spalvotas gylis kei&#269;iasi priklausomai nuo per&#382;i&#363;r&#279;jimo rinkinio savybi&#371;, bet yra paprastai bent jau 24 bitai. Auk&scaron;tos kokyb&#279;s modeliai turi 36-48 bitus spalvoto gylio. Kitas kvalifikavimo parametras skaitytuvui yra savo sprendimas, i&scaron;matuotas vaizdo elementuose per col&#303; (ppi), kartais tiksliau pamin&#279;tas asSamples per col&#303; (spi). U&#382;uot naudoj&#281; skaitytuvo teising&#261; optin&#303; sprendim&#261;, vienintel&#303; reik&scaron;ming&#261; parametr&#261;, gamintojai m&#279;gsta kreiptis &#303; interpoliuot&#261; sprendim&#261;, kuris yra daug auk&scaron;tesnis programin&#279;s &#303;rangos &#303;terpimo d&#279;ka. 2009, auk&scaron;to galo plan&scaron;et&#279;s skaitytuvas gali per&#382;i&#363;r&#279;ti iki 5400 ppi, ir b&#363;gno skeneriai turi optin&#303; sprendim&#261; tarp 3 000 ir 24 000 ppi. [4] Gamintojai da&#382;nai reikalauja interpoliuot&#371; sprendim&#371; taip auk&scaron;tai kaip 19 200 ppi; bet tokie skai&#269;iai ne&scaron;a menk&#261; reik&scaron;ming&#261; vert&#281;, tod&#279;l, kad galim&#371; interpoliuot&#371; vaizdo element&#371; skai&#269;ius yra neribotas ir darantis, taip nedidina sugautos detal&#279;s lygmens. Rinkmenos dydis suk&#363;r&#279; padid&#279;jim&#261; su sprendimo kvadratu; dvigubinimas sprendimo keturgub&#371; dyd&#382;i&#371; rinkmenos dydis. Sprendimas turi b&#363;ti pasirinktas, kuris yra &#303;rangos geb&#279;jimo viduje, saugo pakankam&#261; detal&#281;, ir negamina besaikio dyd&#382;io rinkmenos. Rinkmenos dydis gali b&#363;ti suma&#382;intas duotam sprendimui vartojant "lossy" suspaudimo metodus tokius kaip JPEG, u&#382; ka&#382;koki&#261; kain&#261; geros kokyb&#279;s. Jei geriausia kokyb&#279; yra reikalinga, lossless suspaudimas turi b&#363;ti panaudotas; ma&#382;esnio dyd&#382;io ma&#382;inti-kokyb&#279;s rinkmenos gali b&#363;ti pagamintos i&scaron; tokio atvaizdo kai reikalingas (pavyzd&#382;iui. Atvaizdas ketino b&#363;ti i&scaron;spausdintas ant pilno puslapio, ir daug ma&#382;esn&#279;s rinkmenos, kuri bus rodyta kaip greitai kraudamas tinklalapio dalis). Grynumas gali b&#363;ti ma&#382;intas skaitytuvo triuk&scaron;mo, optinio blykstel&#279;jimo, blogo analogo &#303; skaitmenin&#303; pakeitim&#261;, &#303;br&#279;&#382;imus, dulkes, Niutono &#382;iedus, nery&scaron;ku davikliai, netinkama skaitytuvo operacija, ir bloga programin&#279; &#303;ranga. Pasakoma, kad b&#363;gno skeneriai pagamina gryniausi&#261; skaitmenin&#303; pavaizdavim&#261; filmo, sekto auk&scaron;t&#371; galo filmo skaitytuv&#371;, kurie naudoja didesnius Kodak Tri-linijinius daviklius. Tre&#269;ias svarbus parametras skaitytuvui yra savo tankumo diapazonas (Dinami&scaron;kas Diapazonas) ar Drange (&#382;r. Densitometry). Auk&scaron;tas tankumo diapazonas rei&scaron;kia, kad skaitytuvas sugeba &#303;ra&scaron;yti &scaron;e&scaron;&#279;lines detales ir ry&scaron;kumo detales vienoje per&#382;i&#363;roje. Filmo tankumas yra i&scaron;matuotas ant pagrindo 10 r&#261;sto masto ir kei&#269;iasi tarp 0.0 (vaiskus) ir 4.0, apytiksliai 13 sustojim&#371;. Maksimalus neigiamo filmo tankumas yra iki 3.0-ojo (tankumas), tuo metu, kai skaidr&#279;s filmas gali siekti 4.0-asis. L&#279;tesnis filmas gali pasiekti auk&scaron;tesn&#303; tankum&#261; negu greitesnis filmas. Vartotojo lygmens plan&scaron;et&#279;s skeneriai turi Drange 2.5-3.0 diapazone, tinkamame neigiamam filmui. Auk&scaron;tai galo plan&scaron;et&#279;s skeneriai gali pasiekti Drange 3.7. B&#363;gno skeneriai turi Drange 3.6-4.5. [4], kombinuodami pilnos spalvos vaizdus su 3-aisiais modeliais, &scaron;iuolaikiniai portatyviniai skeneriai sugeba visi&scaron;kai atkurti objektus elektronikos pagalba. 3-&#371;j&#371; spalvot&#371; spausdintuv&#371; prid&#279;jimas &#303;galina tiksl&#371; suma&#382;inim&#261; &scaron;it&#371; objekt&#371;, su parai&scaron;komis per daugel&#303; pramon&#279;s &scaron;ak&#371; ir profesij&#371;.<br/> <span> </span> <br/> <span> </span> <strong> Jungtys prie kompiuterio</strong> <br/> <br/> Dokumento per&#382;i&#363;r&#279;jimas yra tiktai viena proceso dalis. Per&#382;i&#363;r&#279;tam atvaizdui, kad b&#363;t&#371; naudinga, tai turi b&#363;ti perleid&#382;iama nuo skaitytuvo parai&scaron;kai, b&#279;gan&#269;iai ant kompiuterio. Yra du svarb&#363;s klausimai: (1), kaip skaitytuvas yra fizi&scaron;kai prijungtas prie kompiuterio ir (2), kaip parai&scaron;ka i&scaron;traukia informacij&#261; i&scaron; skaitytuvo.<br/> <span> </span> <br/> <span> </span> <strong> Tiesioginis fizinis ry&scaron;ys su kompiuteriu</strong> <br/> Kiekis duomen&#371;, sukurt&#371; skaitytuvo, gali b&#363;ti labai didelis: 600 DPI 23 x 28 cm (9 "x11") (truput&#303; didesnis negu A4 popierius) nesuspaustas 24 bit&#371; atvaizdas yra apytiksliai 100 megabait&#371; duomen&#371;, kurie turi b&#363;ti perleisti ir sukaupti. Neseni skeneriai gali sukurti &scaron;i&#261; apimt&#303; duomen&#371; per sekundes, darydami greit&#261; pageidaujam&#261; ry&scaron;&#303;.<br/> <span> </span> <br/> skeneriai susisieka &#303; j&#371; pagrindin&#303; kompiuter&#303;, naudodami vien&#261; i&scaron; kit&#371; fizini&#371; interfeis&#371;, &#303;ra&scaron;ydami &#303; s&#261;ra&scaron;&#261; nuo l&#279;to &#303; greitai:<br/> <span> </span> <br/> <span> </span> &middot; <strong> Lygiagreti jungtis</strong> - Besijungiantis per lygiagret&#371; uost&#261; yra l&#279;&#269;iausias bendras perk&#279;limo metodas. Ankstyvi skeneriai tur&#279;jo lygiagre&#269;ius uosto ry&scaron;ius, kurie negal&#279;jo perleisti duomen&#371; grei&#269;iau negu 70kilobytes/second. Pirminis lygiagretaus uosto ry&scaron;io prana&scaron;umas buvo ekonominis ir vartotoj&#371; &#303;g&#363;d&#382;io lygmuo: tai i&scaron;veng&#279; prid&#279;ti interfeiso kortel&#281; prie kompiuterio.<br/> <span> </span> <br/> <span> </span> &middot; <strong> GPIB</strong> - Bendras Tikslo Interfeiso Autobusas. Tam tikras drumscanners kaip Howtek D4000 rodytas ir SCSI, ir GPIB interfeisas. Pastarasis atitinka IEEE-488 standart&#261;, &#303;vest&#261; viduryje &rsquo;70-&#371;j&#371;. GPIB-interfeisas buvo tiktai panaudotas keli&#371; skaitytuvo gamybos, daugiausia aptarnaudamas DOS/Windows aplink&#261;. Apple Macintosh sistemoms, Nacionaliniai Instrumentai apr&#363;pino NuBus GPIB interfeiso kortele.<br/> <span> </span> <br/> <span> </span> &middot; <strong> Ma&#382;as Kompiuterin&#279;s sistemos Interfeisas (SCSI)</strong> , kuris yra palaikytas daugumos kompiuteri&#371; tiktai per papildom&#261; SCSI interfeiso kortel&#281;. Kai kurie SCSI skeneriai yra tiekti kartu su specialia SCSI kortele asmeniniam kompiuteriui, nors bet koks SCSI kontrolierius gali b&#363;ti panaudotas. Per vystym&#261;si SCSI standartini&#371; padidint&#371; grei&#269;i&#371;, su atgal suderinamumu; SCSI ry&scaron;ys gali perleisti duomenis auk&scaron;&#269;iausiu grei&#269;iu, kur&#303; ir kontrolierius, ir prietaisas palaiko. SCSI buvo did&#382;ia dalimi pakeistas USB ir Firewire, vienas ar i&scaron; kuri&#371; abu yra tiesiogiai palaikyti daugumos kompiuteri&#371;, ir kurie yra lengvesni &#303;kurti negu SCSI.<br/> <span> </span> <br/> <span> </span> &middot; <strong> Visuotin&#279; Nuosekli Jingtis (USB)</strong> skeneriai gali perleisti duomenis skubiai, ir jie yra lengvesni panaudoti ir pigesnis negu SCSI prietaisai. Ankstyvas USB 1.1 standartas gal&#279;jo perleisti duomenis tiktai 1.5 megabaituose per sekund&#281; (l&#279;&#269;iau negu SCSI), bet v&#279;liau USB 2.0 standartas gali teori&scaron;kai perleisti iki 60 megabait&#371; per sekund&#281; (nors kasdien&#279;s normos yra daug &#382;emesn&#279;s), b&#363;damas greitesn&#279;s operacijos prie&#382;astis.<br/> <span> </span> <br/> <span> </span> &middot; <strong> FireWire</strong> yra interfeisas, kuris yra daug greitesnis negu USB 1.1 ir palyginamas su USB 2.0. FireWire grei&#269;iai yra 25, 50, ir 100, 400 ir 800 megabit&#371; per sekund&#281; (bet prietaisas galb&#363;t nepalaiko vis&#371; grei&#269;i&#371;). Taip pat &#382;inomas kaip: IEEE-1394.<br/> <span> </span> <br/> <span> </span> &middot; <strong> Priklausanti</strong> interfeisai buvo panaudoti ant kai kuri&#371; ankstyv&#371; skaitytuv&#371;, kurie panaudojo priklausan&#269;i&#261; interfeiso kortel&#281;, o ne standartin&#303; interfeis&#261;.<br/> <span> </span> <br/> <span> </span> <strong> Netiesioginis (tinklas) ry&scaron;ys su kompiuteriu</strong> <br/> <span> </span> <br/> <span> </span> Per prad&#382;i&#261; de&scaron;imtos de&scaron;imties, &#303; profesinius plan&scaron;et&#279;s skaitytuvus skyr&#279; profesiniams vartotojams. Kai kurie pardav&#279;jai (kaip Umax) leido vienam skaitytuvui, prijungtam prie pagrindinio kompiuterio funkcionuoti kaip skaitytuvas, prieinamas vis&#371; vartotoj&#371; vietinio kompiuteri&#371; tinklo viduje. Pasirod&#279;, tai buvo labai patogu pavyzd&#382;iui leid&#279;jams, atspaudo parduotuv&#279;ms, ir taip toliau. &Scaron;is funkcionalumas palaipsniui dingo po vidurio - &rsquo;90-ieji, kadangi plan&scaron;et&#279;s skeneriai tapo &#303;perkamesni kasmet. Ta&#269;iau, 2000 ir v&#279;liau, visi drauge daugiatiksliai prietaisai, &#303; kuriuos skiriama, kad aptarnaut&#371; ir (ma&#382;as) &#303;staigas, ir vartotojus paprastai, kombinuoja spausdintuv&#261;, skaitytuv&#261;, kopijavimo aparat&#261; ir faks&#261; &#303; vien&#261; aparat&#261;, pasiekiam&#261; visam workgroup, apr&#363;pindami kiekvien&#261; atskir&#261; faks&#261;, per&#382;i&#363;r&#261;, kopij&#261;, ir spausdina funkcionalum&#261;. Yra taip pat skaitytuvu turinti programin&#279; &#303;ranga, pasiekiama internete.<br/> <span> </span> <br/> <span> </span> <strong> Parai&scaron;kos Programuodamas Interfeis&#261;</strong> <br/> <span> </span> <br/> <span> </span> Da&#382;&#371; parai&scaron;ka tokia kaip GIMP ar Plau&scaron;aplyt&#279;s Fotoparduotuv&#279; turi susisiekti su skaitytuvu. Yra daug skirting&#371; skaitytuv&#371;, ir daugelis t&#371; skaitytuv&#371; naudoja skirtingus protokolus. Kad supaprastint&#371; taikom&#261;j&#303; programavim&#261;, kai kurios Parai&scaron;kos, Programuodamos Interfeisus (programavimo s&#261;saja) buvo i&scaron;vystytos. Programavimo s&#261;saja pristato vienod&#261; interfeis&#261; skaitytuvui. Tai rei&scaron;kia, kad parai&scaron;ka neturi &#382;inoti specifini&#371; skaitytuvo detali&#371;, kad gaut&#371; prieig&#261; prie to tiesiogiai. Pavyzd&#382;iui, Plau&scaron;aplyt&#279;s Fotoparduotuv&#279; palaiko DVIGUB&#260; standart&#261;; tod&#279;l pagal teorij&#261; Fotoparduotuv&#279; gali &#303;sigyti atvaizd&#261; nuo bet kokio skaitytuvo, kuris turi DVIGUB&#260; vairuotoj&#261;. Prakti&scaron;kai, yra da&#382;nai problem&#371; su parai&scaron;ka, susisiekan&#269;ia su skaitytuvu. Ar parai&scaron;ka, ar skaitytuvo gamintojas (ar abu) gali tur&#279;ti klaidas j&#371; programavimo s&#261;sajos i&scaron;tes&#279;jime. Tipi&scaron;kai, programavimo s&#261;saja yra &#303;gyvendinta kaip dinami&scaron;kai sujungta biblioteka. Kiekvienas skaitytuvo gamintojas apr&#363;pina programin&#281; &#303;rang&#261;, kuri ver&#269;ia programavimo s&#261;sajos proced&#363;ros paklausimus &#303; primityvias komandas, kurios yra i&scaron;leistos aparatin&#279;s &#303;rangos kontrolieriui (tokiam kaip SCSI, USB, ar FireWire kontrolierius). Gamintojo programavimo s&#261;sajos dal&#303; paprastai vadina prietaiso vairuotoju, bet tas pa&#382;ym&#279;jimas n&#279;ra grie&#382;tai tikslus: programavimo s&#261;saja neb&#279;ga branduolio b&#363;de ir tiesiogiai negauna prieig&#261; prie prietaiso. Grei&#269;iau skaitytuvo programavimo s&#261;sajos biblioteka ver&#269;ia taikomuosius pra&scaron;ymus &#303; aparatin&#279;s &#303;rangos pra&scaron;ymus. Bendri skaitytuvo programin&#279;s &#303;rangos programavimo s&#261;sajos interfeisai: PROTINGAS (Skaitytuvo Prieiga, Dabar Lengva), yra gal&#279;ti/atvira &scaron;altinio programavimo s&#261;saja tam, kad gaut&#371; prieig&#261; prie skaitytuv&#371;. I&scaron; prad&#382;i&#371; i&scaron;vystytas Unix ir Linux operacin&#279;s sistemos, tai buvo perkelta &#303; OS/2, Mac OS X, ir Microsoft Windows. Skirtingai nuo DVEJETO, PROTINGO, nesielgia su vartotoj&#371; interfeisu. Tai leid&#382;ia partijos per&#382;i&#363;ras ir vaiski&#261; tinklo prieig&#261; be bet kokio ypatingo palaikymo nuo prietaiso vairuotojo. DVEJETAS yra panaudotas daugumos skaitytuv&#371;. I&scaron; prad&#382;i&#371; panaudotas &#382;em&#261; gal&#261; ir nam&#371;-naudojimo &#303;rang&#261;, tai dabar pla&#269;iai panaudojama didel&#279;s apimties per&#382;i&#363;r&#279;jimui. ISIS (Atvaizdas ir Skaitytuvo Interfeiso Specifikacija) sukurtas Vaizdo elemento Vertim&#371;, kuris vis dar naudoja SCSI-ANTRAS d&#279;l atlikimo prie&#382;as&#269;i&#371;, yra panaudotas prie didelio, &#382;inybinis mastas, ma&scaron;inos. WIA (Windows Image Acquisition) yra programavimo s&#261;saja, pateikta Microsoft naudojimui ant Microsoft Windows.<br/> <span> </span> <br/> <span> </span> <strong> Suri&scaron;tos &#303; ry&scaron;ul&#303; parai&scaron;kos</strong> <br/> <span> </span> <br/> <span> </span> Nors jokia programin&#279; &#303;ranga u&#382; per&#382;i&#363;r&#279;jimo naudos n&#279;ra bet kokio skaitytuvo ypatyb&#279;, daug skaitytuv&#371; atvyksta suri&scaron;ti &#303; ry&scaron;ul&#303; su programine &#303;ranga. Tipi&scaron;kai, be per&#382;i&#363;r&#279;jimo naudos, ka&#382;kokio vaizdo redagavimo parai&scaron;kos tipo (tokios kaip Fotoparduotuv&#279;), ir optinis charakterio pripa&#382;inimas (SPAUSDINT&#370; &#381;ENKL&#370; ATPA&#381;INIMAS) programin&#279; &#303;ranga yra tiekti. SPAUSDINT&#370; &#381;ENKL&#370; ATPA&#381;INIMO programin&#279; &#303;ranga paver&#269;ia grafinius atvaizdus teksto &#303; standartin&#303; tekst&#261;, kuris gali b&#363;ti suredaguotas, naudodamas bendr&#261; teksto apdorojim&#261; ir tekst&#261; redaguojan&#269;i&#261; programin&#281; &#303;rang&#261;; tikslumas yra retai puikus.<br/> <span> </span> <br/> <span> </span> <strong> Produkcijos duomenys</strong> <br/> Per&#382;i&#363;r&#279;tas rezultatas yra nesuspaustas RGB atvaizdas, kuris gali b&#363;ti perleistas kompiuterio atmin&#269;iai. Kai kurie skeneriai spaud&#382;ia ir valo atvaizd&#261;, naudodami embedded firmware. Vien&#261; kart&#261; ant kompiuterio, atvaizdas gali b&#363;ti apdirbtas su ta&scaron;kine grafikos programa (tokia kaip Fotoparduotuv&#279; ar GIMP) ir sutaupytas ant laikymo prietaiso (tokio kaip standusis diskas). Atvaizdai yra paprastai kaupiami ant stand&#382;iojo disko. Paveikslai yra normaliai kaupiami atvaizdo formatuose tokiuose kaip nesuspaustas Bitmap, "non-lossy" (lossless) suspaustas APSIPYKIMAS ir PNG, ir "lossy" suspaud&#279; JPEG. Dokumentai yra geriausiai sukaupti APSIPYKIME ar PDF formate; JPEG yra ypa&#269; netinkamas tekstui. Optinis charakterio pripa&#382;inimas (SPAUSDINT&#370; &#381;ENKL&#370; ATPA&#381;INIMAS), programin&#279; &#303;ranga leid&#382;ia per&#382;i&#363;r&#279;tam teksto atvaizdui b&#363;ti paverstas &#303; editable tekst&#261; su protingu tikslumu, kol tekstas yra &scaron;variai i&scaron;spausdintas ir &scaron;rifte ir r&#363;&scaron;iuoja pagal dyd&#303;, kuris gali b&#363;ti perskaitytas programin&#279;s &#303;rangos. SPAUSDINT&#370; &#381;ENKL&#370; ATPA&#381;INIMO geb&#279;jimas gali b&#363;ti sujungtas &#303; per&#382;i&#363;r&#279;jimo programin&#281; &#303;rang&#261;, ar per&#382;i&#363;r&#279;ta atvaizdo rinkmena gali b&#363;ti apdirbta su atskira SPAUSDINT&#370; &#381;ENKL&#370; ATPA&#381;INIMO programa.<br/> <span> </span> <br/> <span> </span> <strong> Dokument&#371; apiforminimas</strong> <br/> <br/> <strong> Dokumento skaitytuvas</strong> <br/> <span> </span> <br/> <span> </span> Per&#382;i&#363;r&#279;jimas ar pervedimas &#303; skaitmenin&#281; form&#261; popierini&#371; dokument&#371; laikymui daro skirtingus per&#382;i&#363;r&#279;jimo &#303;rangos reikalavimus panaudotus negu per&#382;i&#363;r&#279;jimas paveiksl&#371; atgaminimui. Tuo metu, kai dokumentai gali b&#363;ti per&#382;i&#363;r&#279;ti ant bendro tikslo skaitytuv&#371;, tai efektyviau &#303;vykdoma ant speciali&#371; dokumento skaitytuv&#371;. Kai dideli&#371; dokument&#371;, grei&#269;io ir popieriaus apdorojimo kieki&#371; per&#382;i&#363;r&#279;jimas yra labai svarbus, bet per&#382;i&#363;ros sprendimas normaliai bus daug &#382;emesnis negu geram paveiksl&#371; atgaminimui. Dokumento skeneriai turi dokumento valgytojus, paprastai didesnius negu kartais surasti ant kopijavimo aparat&#371; ar visa tikslo skaitytuv&#371;. Per&#382;i&#363;ros yra padarytos dideliu grei&#269;iu, galb&#363;t 20 iki 150 puslapi&#371; per minut&#281;, da&#382;nai grayscale, nors daug skaitytuv&#371; palaiko spalv&#261;. Daug skaitytuv&#371; gali per&#382;i&#363;r&#279;ti abi dvigubas prisijungt&#371; original&#371; puses (dviguba operacija). Pa&#382;eng&#281; dokumento skeneriai turi firmware ar programin&#281; &#303;rang&#261;, kuri valo teksto per&#382;i&#363;ras, kadangi jie yra pagaminti, &scaron;alindami atsitiktines &#382;ymes ir a&scaron;trindami tip&#261;; tai b&#363;t&#371; nepriimtina fotografiniam darbui, kur &#382;ymi&#371; negali patikimai atskirti nuo pageidaujamos puikios detal&#279;s. Sukurtos rinkmenos yra suspaustos, kadangi jie yra padaryti. Panaudotas sprendimas yra paprastai nuo 150 iki 300 dpi, nors aparatin&#279; &#303;ranga gali b&#363;ti gebanti &scaron;iek tiek auk&scaron;tesn&#303; sprendim&#261;; tai gamina atvaizdus teksto, gana gero, kad skaityt&#371; ir optiniam charakterio pripa&#382;inimui (SPAUSDINT&#370; &#381;ENKL&#370; ATPA&#381;INIMAS), be auk&scaron;tesni&#371; reikalavim&#371; ant talpos, reikalingos auk&scaron;tesnio sprendimo atvaizd&#371;. Dokumento per&#382;i&#363;ros yra da&#382;nai apdirbamos, naudodamos SPAUSDINT&#370; &#381;ENKL&#370; ATPA&#381;INIMO technologij&#261;, kad sukurt&#371; editable ir randamas rinkmenas. Dauguma skaitytuv&#371; naudoja ISIS ar TWAINdevice vairuotojus, kad per&#382;i&#363;r&#279;t&#371; dokumentus &#303; APSIPYKIMO format&#261;, kad per&#382;i&#363;r&#279;ti puslapiai gal&#279;t&#371; b&#363;ti pamaitinti &#303; dokumento valdymo sistem&#261;, kuri pasielgs su archyvavimu ir per&#382;i&#363;r&#279;t&#371; puslapi&#371; paie&scaron;ka. Lossy JPEG suspaudimas, kuris yra labai efektyvus paveikslams, yra nepageidaujamas teksto dokumentams, kadangi pakryp&#281; ties&#363;s kra&scaron;tai ima ant dantyto pasirodymo, ir kieto juodaod&#382;io (ar kita spalva), tekstas ant lengvo fono spaud&#382;ia gerai su lossless suspaudimo formatais. Tuo metu, kai popierinis maitinimas ir per&#382;i&#363;r&#279;jimas gali b&#363;ti padaryti, automatically ir skubiai, ruo&scaron;imasis ir indeksavimas yra b&#363;tini ir reikalingas daug &#382;moni&#371; darbo. Ruo&scaron;imasis apima rankomis popieri&#371; ap&#382;i&#363;r&#279;jim&#261;, kurie bus per&#382;i&#363;r&#279;ti ir &#303;sitikinimas, kad jie yra, kad, atskleistas, be pagrindini&#371; dalyk&#371; ar ka&#382;ko kita, kas gal&#279;t&#371; suspausti skaitytuv&#261;. Papildomai, kai kurios pramon&#279;s &scaron;akos toks kaip teis&#279;tas ir medicinos gali reikalingas, kad dokumentai, kad tur&#279;t&#371; Susilpnint&#371; Numeravim&#261; ar ka&#382;koki&#261; kit&#261; &#382;ym&#281;, duodan&#269;i&#261; dokumento identifikavimo numer&#303; ir dokumento per&#382;i&#363;ros dat&#261;/laik&#261;. Indeksavimas apima besijungian&#269;ius tinkamus reik&scaron;minius &#382;od&#382;ius &#303; rinkmenas, kad jie gal&#279;t&#371; b&#363;ti atkurti turinio. &Scaron;is procesas gali kartais b&#363;ti automatizuojamas tam tikru laipsniu, bet jis da&#382;nai reikalingas rankinio darbo, &#303;vykdyto duomen&#371; &#303;&#279;jimo tarnautoj&#371;. Viena &#303;prasta praktika yra br&#363;k&scaron;ninio kodo pripa&#382;inimo technologijos naudojimas: per ruo&scaron;im&#261;si, br&#363;k&scaron;ninio kodo lapai su aplanko vardais ar indekso informacija yra &#303;d&#279;ti &#303; dokumento rinkmenas, aplankus, ir dokumento grupes. Naudojant automatin&#303; partijos per&#382;i&#363;r&#279;jim&#261;, dokumentai yra sutaupyti &#303; tinkamus aplankus, ir indeksas yra sukurtas integracijai &#303; dokumento valdymo sistemas. Specializuota dokumento per&#382;i&#363;r&#279;jimo forma yra knygos per&#382;i&#363;r&#279;jimas. Techniniai sunkumai kyla i&scaron; knyg&#371;, paprastai suri&scaron;t&#371; ir kartais trapus ir nepakei&#269;iamas, bet kai kurie gamintojai i&scaron;vyst&#279; apibr&#279;&#382;tus mechanizmus, kad tur&#279;t&#371; reikalo su tuo. Da&#382;nai ypatingi robotic mechanizmai yra panaudoti, kad automatizuot&#371; puslapio virtim&#261; ir per&#382;i&#363;r&#279;jim&#261; proceso.<br/> <span> </span> <br/> <span> </span> <strong> Dokumento telekameros </strong> <strong> skeneriai</strong> <br/> sceyeX dokumento telekamera.<br/> <span> </span> <br/> <span> </span> Nauja dokumento skaitytuvo kategorija yra dokumento telekamera. Tai nesisieja su prietaisais, kurie yra panaudoti kaip regimieji pateik&#279;jai, grei&#269;iau vietoj to svarbiausiu dokumento per&#382;i&#363;r&#279;jimo tikslu.<br/> <span> </span> <br/> <span> </span> Procesas gauti atvaizdus ant dokumento telekamer&#371; atsiskiria nuo tos plan&scaron;et&#279;s ir Automatini&#371; dokumento valgytojo skaitytuv&#371;, kuriuose n&#279;ra joki&#371; judan&#269;i&#371; dali&#371;, reikaling&#371; per&#382;i&#363;r&#279;ti objekt&#261;. Tradici&scaron;kai kiekvienas, ap&scaron;vietimo/at&scaron;vaito ryk&scaron;t&#279; skaitytuve turi b&#363;ti pasitraukta dokumentas (toks o d&#279;l plan&scaron;et&#279;s skaitytuvo), ar dokumentas turi b&#363;ti perduotas per ryk&scaron;t&#281; (toks o d&#279;l valgytojo skaitytuv&#371;), kad pagamint&#371; viso atvaizdo per&#382;i&#363;r&#261;. Dokumento telekameros gauna vis&#261; dokument&#261; ar objekt&#261; viename &#382;ingsnyje, paprastai tu&#269;tuojau. Tipi&scaron;kai, dokumentai yra pad&#279;ti ant plok&scaron;&#269;io pavir&scaron;iaus, paprastai &#303;staigos ra&scaron;omasis stalas, po dokumento telekameros grobimo rajonu. Procesas gauti "vis&#261; pavir&scaron;i&#371; tuojau pat" turi naud&#261; did&#279;jan&#269;io reakcijos laiko per&#382;i&#363;r&#279;jimo darbo srautui. b&#363;dami sugauti, atvaizdai yra paprastai apdirbami per programin&#281; &#303;rang&#261;, kuri gali padidinti atvaizd&#261; ir &#303;vykdyti tokias u&#382;duotis kaip automatically sukimas, apkarpymas ir j&#371; tiesinimas. [5] n&#279;ra reikalinga, kad dokumentai ar objektai, per&#382;i&#363;r&#279;ti, u&#382;mezga pa&#382;int&#303; su dokumento telekamera, tod&#279;l didindami lankstum&#261; tip&#371; dokument&#371;, kurie sugeba b&#363;ti per&#382;i&#363;r&#279;ti. Objektai, kurie anks&#269;iau buvo sud&#279;tingi per&#382;i&#363;r&#279;ti ant tradicini&#371; skaitytuv&#371; dabar sugeba b&#363;ti padaryti taip su vienu prietaisu. Tai apima &#303; tam tikrus dokumentus, kurie yra keisti dyd&#382;ius ir formas, susegtas, aplankuose ar lenktas/sulamdytas, kuris gali b&#363;ti suspaustas perdavimo skaitytuve. Kiti objektai apima knygas, &#382;urnalus, kvitus, lai&scaron;kus, bilietai ir taip toliau. Jokios judan&#269;ios dalys negali taip pat nune&scaron;ti reikalingumo palaikymo, apsvarstymo Visoje kainoje nuosavyb&#279;s, kuri apima besit&#281;sian&#269;ias naudojamas skaitytuv&#371; kainas. Padidintas reakcijos laikas, per&#382;i&#363;r&#279;damas taip pat turi pa&scaron;alp&#261; konteksto per&#382;i&#363;r&#279;jimo karalyst&#279;je. AUTOMATINIO KRYPTIES NUSTATYMO &#302;RENGINIO skeneriai, kol labai greitas ir labai geras partijos per&#382;i&#363;r&#279;jime, taip pat reikalingas prie&scaron;-ir po - dokument&#371; apdirbimas. Dokumento telekameros sugeba b&#363;ti integruotos tiesiogiai &#303; aWorkflow ar proces&#261;, pavyzd&#382;iui kasininkas banke. Dokumentas yra per&#382;i&#363;r&#279;tas tiesiogiai kontekste kliento, kurio tai turi b&#363;ti padedama ar panaudojama. Reakcijos laikas yra prana&scaron;umas &scaron;itose situacijose. Dokumento telekameros paprastai taip pat reikalingas ma&#382;o kiekio erdv&#279;s ir yra da&#382;nai portatyvios. [6], Kol per&#382;i&#363;r&#279;jimas su dokumento telekameromis gali tur&#279;ti greit&#261; reakcijos laik&#261;, didelius kiekius partijos per&#382;i&#363;r&#279;jimo net, nesusegti dokumentai yra efektyvesni su AUTOMATINIO KRYPTIES NUSTATYMO &#302;RENGINIO skaitytuvu. Yra i&scaron;&scaron;&#363;ki&#371;, kurie stovi su &scaron;ia r&#363;&scaron;imi technologijos d&#279;l i&scaron;orini&#371; veiksni&#371; (toki&#371; kaip ap&scaron;vietimas), kuris gali tur&#279;ti &#303;tak&#261; per&#382;i&#363;ros rezultatams. Kelias, kuriame &scaron;itos svarstomos problemos yra nuspr&#281;stos smarkiai priklauso nuo i&scaron;prusimo produkto ir kaip tai turi reikalo su &scaron;itomis svarstomomis problemomis<br/> <span> </span> <br/> <span> </span> <strong> Infraraudonas valymas</strong> <br/> <span> </span> <br/> <span> </span> <br/> <strong> Infraraudonas valymas</strong> yra technika, panaudota, kad nune&scaron;t&#371; padarinius dulki&#371; ir &#303;br&#279;&#382;im&#371; ant atvaizd&#371;, per&#382;i&#363;r&#279;t&#371; nuo filmo; daug &scaron;iuolaikini&#371; skaitytuv&#371; &#303;traukia &scaron;i&#261; ypatyb&#281;. Tai dirba, per&#382;i&#363;rint film&#261; su infraraudona &scaron;viesa. Nuo to, galima aptikti dulkes ir &#303;br&#279;&#382;imus, kurie nupjov&#279; infraraudon&#261; &scaron;vies&#261;; ir jie gali tada b&#363;ti nune&scaron;tu automatically, svarstydami j&#371; pad&#279;t&#303;, dyd&#303;, form&#261;, ir apylinkes. Skaitytuvo gamintojai paprastai prideda savo sav&#261; vard&#261; prie &scaron;ios technikos. Pavyzd&#382;iui, Epson, Nikon, Microtek, ir kiti naudoja Skaitmenin&#303; LED&#260;, tuo metu, kai Kanonas naudoja savo sav&#261; sistemos MOKEST&#302; U&#381; VA&#381;IAVIM&#260; (Filmas Automatin&#279; Retu&scaron;avimo ir Pak&#279;limo sistema). [8] Plustek naudoja LaserSoft Vaizdo gavim&#261; iSRD. Kai kurie nepriklausomi programin&#279;s &#303;rangos supirk&#279;jai projektuoja savo savus infraraudonus valymo &#303;rankius.. Skaityti pla&#269;iau <br/> <span> </span> <br/> <span> </span> 0 Comments <h2> Author</h2> <p> Write something about yourself. No need to be fancy, just an overview.</p> <h2> Archives</h2> <p> December 2013 <br/> </p> <h2> Categories</h2> <p> All <br/> </p> <p> RSS Feed </p> Powered by <span> </span> <span> Create your own unique website with customizable templates.</span> <span> Get Started </span>
					</div>
					<div><a href="#" class="links">View Full Story</a></div>
				</div>
		
			</div>
			<!-- end #content -->
			<div id="sidebar">
				<ul>
					<li>
						<h2>Aliquam tempus</h2>
						<p>Mauris vitae nisl nec metus placerat perdiet est. Phasellus dapibus semper urna. Pellentesque ornare, orci in consectetuer hendrerit, volutpat.</p>
					</li>
					<li>
						<h2>Pellenteque ornare </h2>
						<img src="img/4ee79a3e24ecd213d2cfe57bd6202264.jpg" width="50%"/>
					<ul>
<li><a href="index.html">Skeneriai - skeneriai</a><br> Skeneriai visada turi įdiegtą programinę įrangą, kuri gali atlikti OCR (optinio simbolių atpažinimo) funkciją, ir apskritai, skeneriai yra pakankamai spartūs, kad per minutę nuskenuotų tuzinus lapų. Skenerio naudojimas yra paprastas.</li>
<li><a href="1.html">Skeneriai · Mes padėsime PASIRINKTI | Varlė.lt</a><br> Palygink skirtingų parduotuvių kainas Nuo 62.09 € Skeneriai Akcijos, atsiliepimai.</li>
<li><a href="2.html">Skeneriai | Spausdintuvai, skeneriai, planšetės | Prekių ...</a><br> Skeneriai Skeneris - tai įrenginys, skirtas perkelti norimus dokumentus, diagramas, nuotraukas ar kitus leidinius į kompiuterį. Pažengus šiuolaikinėms technologijoms mobiliuoju skeneriu nuskenuotas dokumentas ar knygos pastraipa gali būti perkelti tiesiai į atminties kortelę.</li>
<li><a href="3.html">Skeneriai - Internetinė parduotuvė 1a.lt</a><br> Skeneriai Dokumentų naikikliai Spausdintuvų kasetės Popierius Kompiuterių aksesuarai Klaviatūros Pelės Kilimėliai Ausinės Kolonėlės Internetinės ir IP kameros Krepšiai, dėklai ir kuprinės</li>
<li><a href="4.html">Skeneriai | Mobilūs skeneriai | 3D skeneris | TOPO CENTRAS ...</a><br> Stacionarūs ir mobilieji / nešiojami dokumentų skeneriai. Įsigykite pas mus Plustek, Avision, Epson, Brother skenerius internetu greičiau ir patogiau.</li>
<li><a href="5.html">Skeneriai Internetu pigiau Žema kaina | b-a.eu</a><br> Skeneriai – patrauklios kainos ir platus Epson, Canon, HP gamintojų asortimentas! Paprasta pirkti ir užsisakyti skenerius iš internetinės parduotuvės 1a.lt!</li>
<li><a href="6.html">Skaneriai | www.prekes.net</a><br> Skeneriai internetinėje parduotuvėje Senukai.lt. Galimybė pirkti išsimokėtinai ar prekių pristatymo metu. Užsisakykite jau dabar!</li>
<li><a href="7.html">Skeneriai - kainos nuo 62.09 € | Kaina24.lt</a><br> Mobilūs skeneriai yra pigesni ir gerokai mažesni, skirti lengvam prietaiso gabenimui. Jį galite nusinešti į draugo namus, pajungti (dažniausiai per Wi-fi) prie draugo kompiuterio ir naudoti pagal paskirtį. Stacionarūs skeneriai yra brangesni ir didesni, jie skirti namų naudojimui, kai nereikia dažnai keisti prietaiso buvimo vietos.</li>
<li><a href="8.html">Skeneriai, IT technika fotografams Skeneriai</a><br> Dokumentų skeneriai. Priklausomai nuo skenavimo poreikio, pas mus galite rasti standartinius dokumentų skenerius ir aukštos klasės, profesionalius greitaeigius dokumentų kopijuoklius. Esant minimaliems skenavimo poreikiams visada pakaks standartinio skenerio su stiklu ir dangčiu. Esant poreikiui skenuoti didelius kiekius dokumentų ...</li>
<li><a href="9.html">Skeneriai | Išoriniai kompiuterių priedai | Senukai.lt</a><br> UAB “Biuro gidas” Kęstučio g.62A, Vilnius LT-08112 +370 607 89993 info@biurogidas.lt PVM Mokėtojo kodas: LT100006794311 Įmonės kodas: 302764569 Svetainės žemėlapis</li>
</ul>
					</li>
					<li>
						<h2>Category</h2>
<ul>
<li><a href="index.html">Skeneriai - skeneriai</a></li>
<li><a href="1.html">Skeneriai · Mes padėsime PASIRINKTI | Varlė.lt</a><br></li>
<li><a href="2.html">Skeneriai | Spausdintuvai, skeneriai, planšetės | Prekių ...</a><br></li>
<li><a href="3.html">Skeneriai - Internetinė parduotuvė 1a.lt</a><br></li>
<li><a href="4.html">Skeneriai | Mobilūs skeneriai | 3D skeneris | TOPO CENTRAS ...</a><br></li>
<li><a href="5.html">Skeneriai Internetu pigiau Žema kaina | b-a.eu</a><br></li>
<li><a href="6.html">Skaneriai | www.prekes.net</a><br></li>
<li><a href="7.html">Skeneriai - kainos nuo 62.09 € | Kaina24.lt</a><br></li>
<li><a href="8.html">Skeneriai, IT technika fotografams Skeneriai</a><br></li>
<li><a href="9.html">Skeneriai | Išoriniai kompiuterių priedai | Senukai.lt</a><br></li>
</ul>
					</li>
				</ul>
			</div>
			<!-- end #sidebar -->
			<div style="clear: both;">&nbsp;</div>
		</div>
		<!-- end #page -->
	</div>
</div>
<div id="footer-bgcontent">
	<div id="footer">
		<p>Copyright (c) 2008 Sitename.com. All rights reserved. Design by Free CSS Templates.</p>
		<p></p>
	</div>
	<!-- end #footer -->
</div>
</body>
</html>
